In [1]:
import pandas as pd

### Missing at Random - if there are other variables that might be used to predict the variable which is Missing
### Missing Completely at Random (MCAR) - no relationship to other variables

In [2]:
df = pd.read_csv('StudentsPerformance.csv')
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [3]:
mask = df.isnull()
mask.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False,False
7,False,False,False,False,False,False,False,False
8,False,False,False,False,False,False,False,False
9,False,False,False,False,False,False,False,False

### dropna() function - drop rows with any missing data

In [4]:
df.dropna().head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

### fillna()

In [6]:
df.fillna(0, inplace=True) # inplace modifies the df you have
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [15]:
df = pd.read_csv('Inpatient.csv')
df.head(20)

,Case No,Subject ID,Admission Date\n(dd/mm/yyyy),Discharge Date\n(dd/mm/yyyy),Age\n(Years),Race,Gender,Adm Type Desc,Age Group,LOS,Readmitted_30
0,90001,1,7/1/2017,13/1/2017,65,Chinese,Male,Emergency,51-60,6 days,0
1,90002,2,2/1/2017,4/1/2017,52,Chinese,Male,Emergency,41-50,2 days,0
2,90003,3,26/12/2016,6/1/2017,73,Chinese,Female,Emergency,61-70,11 days,1
3,90004,3,17/1/2017,20/1/2017,73,Chinese,Female,Elective inpa,61-70,3 days,0
4,90049,3,20/3/2017,23/3/2017,73,Chinese,Female,Elective inpa,61-70,3 days,1
5,90032,3,13/2/2017,16/2/2017,73,Chinese,Female,Elective inpa,61-70,3 days,0
6,90005,4,28/1/2017,31/1/2017,74,Malay,Female,Emergency,61-70,3 days,0
7,90006,5,2/1/2017,6/1/2017,53,Indian,Male,Emergency,41-50,4 days,0
8,90007,6,13/1/2017,16/1/2017,69,Malay,Female,Emergency,51-60,3 days,0
9,90008,7,9/1/2017,10/1/2017,51,Indian,Male,Emergency,41-50,1 days,0
10,90272,8,16/12/2017,19/12/2017,57,Indian,Male,Emergency,41-50,3 days,1
11,90126,8,6/6/2017,8/6/2017,57,Indian,Male,Emergency,41-50,2 days,1
12,90113,8,3/6/2017,3/6/2017,57,Indian,Male,Emergency,41-50,0 days,1
13,90053,8,5/3/2017,13/3/2017,56,Indian,Male,Emergency,41-50,8 days,1
14,90009,8,20/12/2016,3/1/2017,56,Indian,Male,Emergency,41-50,14 days,0
15,90010,9,2/1/2017,4/1/2017,52,Indian,Male,Emergency,41-50,2 days,0
16,90225,10,26/10/2017,29/10/2017,74,Chinese,Male,Emergency,61-70,3 days,1
17,90011,10,31/12/2016,3/1/2017,73,Chinese,Male,Emergency,61-70,3 days,0
18,90217,10,11/10/2017,16/10/2017,74,Chinese,Male,Emergency,61-70,5 days,0

In [16]:
df = df.reset_index()
df = df.set_index(['Subject ID', 'Admission Date\n(dd/mm/yyyy)'])
df.head(20)

                                         index  Case No  \
Subject ID Admission Date\n(dd/mm/yyyy)
1          7/1/2017                          0    90001
2          2/1/2017                          1    90002
3          26/12/2016                        2    90003
           17/1/2017                         3    90004
           20/3/2017                         4    90049
           13/2/2017                         5    90032
4          28/1/2017                         6    90005
5          2/1/2017                          7    90006
6          13/1/2017                         8    90007
7          9/1/2017                          9    90008
8          16/12/2017                       10    90272
           6/6/2017                         11    90126
           3/6/2017                         12    90113
           5/3/2017                         13    90053
           20/12/2016                       14    90009
9          2/1/2017                         15    90010
10         26/10/2017                       16    90225
           31/12/2016                       17    90011
           11/10/2017                       18    90217

                                        Discharge Date\n(dd/mm/yyyy)  \
Subject ID Admission Date\n(dd/mm/yyyy)
1          7/1/2017                                        13/1/2017
2          2/1/2017                                         4/1/2017
3          26/12/2016                                       6/1/2017
           17/1/2017                                       20/1/2017
           20/3/2017                                       23/3/2017
           13/2/2017                                       16/2/2017
4          28/1/2017                                       31/1/2017
5          2/1/2017                                         6/1/2017
6          13/1/2017                                       16/1/2017
7          9/1/2017                                        10/1/2017
8          16/12/2017                                     19/12/2017
           6/6/2017                                         8/6/2017
           3/6/2017                                         3/6/2017
           5/3/2017                                        13/3/2017
           20/12/2016                                       3/1/2017
9          2/1/2017                                         4/1/2017
10         26/10/2017                                     29/10/2017
           31/12/2016                                       3/1/2017
           11/10/2017                                     16/10/2017

                                         Age\n(Years)     Race  Gender  \
Subject ID Admission Date\n(dd/mm/yyyy)
1          7/1/2017                                65  Chinese    Male
2          2/1/2017                                52  Chinese    Male
3          26/12/2016                              73  Chinese  Female
           17/1/2017                               73  Chinese  Female
           20/3/2017                               73  Chinese  Female
           13/2/2017                               73  Chinese  Female
4          28/1/2017                               74    Malay  Female
5          2/1/2017                                53   Indian    Male
6          13/1/2017                               69    Malay  Female
7          9/1/2017                                51   Indian    Male
8          16/12/2017                              57   Indian    Male
           6/6/2017                                57   Indian    Male
           3/6/2017                                57   Indian    Male
           5/3/2017                                56   Indian    Male
           20/12/2016                              56   Indian    Male
9          2/1/2017                                52   Indian    Male
10         26/10/2017                              74  Chinese    Male
           31/12/2016                              73  Chinese    Male
           11/10/2017                              74  Chinese    Male

                                         Adm Type Desc Age Group      LOS  \
Subject ID Admission Date\n(dd/mm/yyyy)
1          7/1/2017                          Emergency     51-60   6 days
2          2/1/2017                          Emergency     41-50   2 days
3          26/12/2016                        Emergency     61-70  11 days
           17/1/2017                     Elective inpa     61-70   3 days
           20/3/2017                     Elective inpa     61-70   3 days
           13/2/2017                     Elective inpa     61-70   3 days
4          28/1/2017                         Emergency     61-70   3 days
5          2/1/2017                          Emergency     41-50   4 days
6          13/1/2017                         Emergency     51-60   3 days
7          9/1/2017                          Emergency     41-50   1 days
8          16/12/2017                        Emergency     41-50   3 days
           6/6/2017                          Emergency     41-50   2 days
           3/6/2017                          Emergency     41-50   0 days
           5/3/2017                          Emergency     41-50   8 days
           20/12/2016                        Emergency     41-50  14 days
9          2/1/2017                          Emergency     41-50   2 days
10         26/10/2017                        Emergency     61-70   3 days
           31/12/2016                        Emergency     61-70   3 days
           11/10/2017                        Emergency     61-70   5 days

                                         Readmitted_30
Subject ID Admission Date\n(dd/mm/yyyy)
1          7/1/2017                                  0
2          2/1/2017                                  0
3          26/12/2016                                1
           17/1/2017                                 0
           20/3/2017                                 1
           13/2/2017                                 0
4          28/1/2017                                 0
5          2/1/2017                                  0
6          13/1/2017                                 0
7          9/1/2017                                  0
8          16/12/2017                                1
           6/6/2017                                  1
           3/6/2017                                  1
           5/3/2017                                  1
           20/12/2016                                0
9          2/1/2017                                  0
10         26/10/2017                                1
           31/12/2016                                0
           11/10/2017                                0

### ffill - fill missing data

In [17]:
df = df.fillna(method='ffill')
df.head()

                                         index  Case No  \
Subject ID Admission Date\n(dd/mm/yyyy)
1          7/1/2017                          0    90001
2          2/1/2017                          1    90002
3          26/12/2016                        2    90003
           17/1/2017                         3    90004
           20/3/2017                         4    90049

                                        Discharge Date\n(dd/mm/yyyy)  \
Subject ID Admission Date\n(dd/mm/yyyy)
1          7/1/2017                                        13/1/2017
2          2/1/2017                                         4/1/2017
3          26/12/2016                                       6/1/2017
           17/1/2017                                       20/1/2017
           20/3/2017                                       23/3/2017

                                         Age\n(Years)     Race  Gender  \
Subject ID Admission Date\n(dd/mm/yyyy)
1          7/1/2017                                65  Chinese    Male
2          2/1/2017                                52  Chinese    Male
3          26/12/2016                              73  Chinese  Female
           17/1/2017                               73  Chinese  Female
           20/3/2017                               73  Chinese  Female

                                         Adm Type Desc Age Group      LOS  \
Subject ID Admission Date\n(dd/mm/yyyy)
1          7/1/2017                          Emergency     51-60   6 days
2          2/1/2017                          Emergency     41-50   2 days
3          26/12/2016                        Emergency     61-70  11 days
           17/1/2017                     Elective inpa     61-70   3 days
           20/3/2017                     Elective inpa     61-70   3 days

                                         Readmitted_30
Subject ID Admission Date\n(dd/mm/yyyy)
1          7/1/2017                                  0
2          2/1/2017                                  0
3          26/12/2016                                1
           17/1/2017                                 0
           20/3/2017                                 1

In [19]:
df = pd.DataFrame({
    'A': [1,1,2,3,4],
    'B': [3,6,3,8,9],
    'C': ['a','b','c','d','e']
})
df

   A  B  C
0  1  3  a
1  1  6  b
2  2  3  c
3  3  8  d
4  4  9  e

### replace()

In [20]:
df.replace(1,100)

     A  B  C
0  100  3  a
1  100  6  b
2    2  3  c
3    3  8  d
4    4  9  e

In [21]:
df.replace([1,3], [100,300])

     A    B  C
0  100  300  a
1  100    6  b
2    2  300  c
3  300    8  d
4    4    9  e

In [23]:
# want to detect all html pages (ends with .html) - overwrite that with 'webpage'
df.replace(to_replace=".*.html$", value="webpage", regex=True)

   A  B  C
0  1  3  a
1  1  6  b
2  2  3  c
3  3  8  d
4  4  9  e